Repository: andrevidela/Hackerspaces-iOS
Catalog: Hackerspaces/*.lproj/Localizable.strings
Languages: fr

# FavoriteHackerspaceTitle
source: Favorites
fr: Favoris

# EmptyFavoriteListMessage
source: Select your favorite hackerspace from search or map
fr: Selectionnez vos Hackerspace favoris depuis la recherche ou la carte

source: Custom Endpoint
fr: Serveur personalisé

# CustomNameCantBeEmpty
source: Custom endpoint name can't be empty
fr: Le nom ne peut pas être vide

# CustomURLCantBeEmpty
source: Custom endpoint URL can't be empty
fr: L'URL ne peut pas être vide

# AdvancedModeEngagedTitle
source: Advanced mode enabled
fr: Mode Avancé activé

# AdvancedModeEngagedMessage
source: Advanced mode displays more advanced features useful for hackerspace API developers
fr: Le Mode Avancé expose des fonctionnalités avancées utiles pour les développeurs

# PullToEngage
source: Pull to disable Advanced Mode
fr: Tirez pour activer le Mode Avancé

# PullToDisengage
source: Pull to enable Advanced Mode
fr: Tirez pour desactiver le Mode Avancé

# DeleteCacheTitle
source: Deleting Cache
fr: Effacer le cache

# DeleteCacheMessage
source: Are you sure you want to delete the local cache?
fr: Êtes-vous sûr de vouloir effacer les données enregistrées en cache?

# AnswerIndicator
source: A
fr: R

# CannotFindHSQuestion
source: Why can't I find my local hackerspace in the list?
fr: Pourquoi est-ce que je ne peux pas trouver mon hackerspace local?

# CannotFindHSAnswer
source: Only hackerspaces registered on the OpenSpace Directory are visible. For it to be visible in the app, your hackerspace needs to expose an API that conforms to the SpaceAPI.net format and register itself on Open Space Directory.
fr: Seuls les Hackespaces enregistré sur l'OpenSpace Directory sont visible. Afin d'être visibe dans l'app, votre hackerspace local doit exposer une API conforme à la specification décrite sur SpaceAPI.net et s'enregistrer sur l'OpenSpace Directory

# HowToAddHSQuestion
source: How can I add my local hackerspace?
fr: Comment ajouter mon hackerspace dans l'OpenSpace Directory?

# HowToAddHSAnswer
source: You will need a server that exposes a public API. Once your API is up and running you can register it's address at the OpenSpace directory (https://github.com/fixme-lausanne/OpenSpaceDirectory) by making a pull request. Once the pull request is accepted your Hackerspace will be visible in the app. If you want to test your API inside the app before it's added to the Open Space DIrectory you can add it as a custom endpoint in the advanced settings. To enable advanced settings, pull the settings list and select "ok".
fr: Vous aurez besoin d'un serveur qui expose une API public sous le format décrit par SpaceAPI.net. Une fois que le serveur est prêt vous pouvez enregistrer son URL dans l'OpenSpace Directory (https://github.com/fixme-lausanne/OpenSpaceDirectory) en créant une "pull request". Une fois que la pull request est acceptée votre hackerspace sera visible dans l'app. Si vous souhaiter tester votre API avec l'app avant qu'elle soit ajoutée sur l'OpenSpace Directory vous pouvez activer le mode avancé dans les préférences. Pour activer le mode avancé simplement tirez la liste depuis le haut et selectionner "Ok"

# ReportBugQuestion
source: Something is wrong with the app, what can I do?
fr: Quelque-chose ne va pas avec l'app, que puis-je faire?

# ReportBugAnswer
source: You can communicate any issue with the app on the github repository at https://github.com/zhaar/Hackerspaces-iOS/issues. You can even issue pull requests to enable more functionalities.
fr: Vous pouvez partager quelque problème que vous rencontrez avec l'app sur la page Github du projet à l'adresse https://github.com/zhaar/Hackerspaces-iOS/issues. Vous pouvez même permettre d'incorporer de nouvelles fonctionnalités en créant une issue ou une pull request.

source: Delete
fr: Supprimer

# HackerspaceOpen
source: open
fr: Ouvert

source: Edit
fr: Modifier

source: Name
fr: Nom
